
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>面试官：谈谈对物理内存和虚拟内存的理解，一文带你彻底搞懂 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="../02/浅谈linux内存管理.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../../">
            
                <a href="../../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../01/linux_tools_cmd.html">
            
                <a href="../01/linux_tools_cmd.html">
            
                    
                    Linux下「进程」出问题不要慌，资深程序员教你6招搞定！
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../02/浅谈linux内存管理.html">
            
                <a href="../02/浅谈linux内存管理.html">
            
                    
                    别再说你不懂Linux内存管理了，10张图给你安排的明明白白
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="linux物理页管理算法.html">
            
                <a href="linux物理页管理算法.html">
            
                    
                    面试官：谈谈对物理内存和虚拟内存的理解，一文带你彻底搞懂
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../../.." >面试官：谈谈对物理内存和虚拟内存的理解，一文带你彻底搞懂</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x4ECA;&#x5929;&#x7EE7;&#x7EED;&#x6765;&#x5B66;&#x4E60;Linux&#x5185;&#x5B58;&#x7BA1;&#x7406;&#xFF0C;&#x4EC0;&#x4E48;&#xFF1F;&#x4F60;&#x66F4;&#x60F3;&#x5B66;&#x65F6;&#x95F4;&#x7BA1;&#x7406;&#xFF0C;&#x6211;&#x4E0D;&#x914D;&#xFF0C;&#x62B1;&#x4E2A;&#x897F;&#x74DC;&#x53BB;&#x5FAE;&#x535A;&#x5B66;&#x5427;&#x3002;</p>
<p> <img src="https://i0.hdslb.com/bfs/article/666d2ea83d750ee420d79b3308f6cb164b9fc5a9.gif" alt="img"> </p>
<p>&#x8A00;&#x5F52;&#x6B63;&#x4F20;&#xFF0C;&#x4E0A;&#x4E00;&#x7BC7;&#x6587;&#x7AE0; <a href="https://mp.weixin.qq.com/s?__biz=MzIwMjM4NDE1Nw==&amp;mid=2247483865&amp;idx=1&amp;sn=dfa63a467b620b6131acaef9ea6874a3&amp;chksm=96de37aba1a9bebdcc097314f40ae633bd393253759ecd970ac84cdb41f18994da9405dbf356&amp;token=1178579599&amp;lang=zh_CN#rd" target="_blank">&#x522B;&#x518D;&#x8BF4;&#x4F60;&#x4E0D;&#x61C2;Linux&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x4E86;&#xFF0C;10&#x5F20;&#x56FE;&#x7ED9;&#x4F60;&#x5B89;&#x6392;&#x7684;&#x660E;&#x660E;&#x767D;&#x767D;&#xFF01;</a> &#x5206;&#x6790;&#x4E86; Linux &#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF0C;&#x5982;&#x679C;&#x5DF2;&#x7ECF;&#x5FD8;&#x4E86;&#x7684;&#x540C;&#x5B66;&#x8FD8;&#x53EF;&#x4EE5;&#x56DE;&#x5934;&#x770B;&#x4E0B;&#xFF0C;&#x5E76;&#x4E14;&#x4E5F;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x5148;&#x9605;&#x8BFB;&#x90A3;&#x4E00;&#x7BC7;&#x518D;&#x6765;&#x770B;&#x8FD9;&#x4E00;&#x7BC7;&#x3002;&#x9650;&#x4E8E;&#x7BC7;&#x5E45;&#xFF0C;&#x4E0A;&#x4E00;&#x7BC7;&#x6CA1;&#x6709;&#x6DF1;&#x5165;&#x5B66;&#x4E60;&#x7269;&#x7406;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x548C;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x5206;&#x914D;&#xFF0C;&#x4ECA;&#x5929;&#x5C31;&#x6765;&#x5B66;&#x4E60;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x524D;&#x9762;&#x7684;&#x5B66;&#x4E60;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x7A0B;&#x5E8F;&#x53EF;&#x6CA1;&#x8FD9;&#x4E48;&#x597D;&#x9A97;&#xFF0C;&#x4EFB;&#x4F60;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x628A;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x73A9;&#x51FA;&#x82B1;&#x6765;&#xFF0C;&#x5230;&#x6700;&#x540E;&#x8FD8;&#x662F;&#x8981;&#x7ED9;&#x7A0B;&#x5E8F;&#x5B9E;&#x5B9E;&#x5728;&#x5728;&#x7684;&#x7269;&#x7406;&#x5185;&#x5B58;&#xFF0C;&#x4E0D;&#x7136;&#x7A0B;&#x5E8F;&#x5C31;&#x8981;&#x7F62;&#x5DE5;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x7269;&#x7406;&#x5185;&#x5B58;&#x8FD9;&#x4E48;&#x91CD;&#x8981;&#x7684;&#x8D44;&#x6E90;&#x4E00;&#x5B9A;&#x8981;&#x597D;&#x597D;&#x7BA1;&#x7406;&#x8D77;&#x6765;&#x4F7F;&#x7528;&#xFF08;&#x7269;&#x7406;&#x5185;&#x5B58;&#xFF0C;&#x5C31;&#x662F;&#x4F60;&#x5B9E;&#x5B9E;&#x5728;&#x5728;&#x7684;&#x5185;&#x5B58;&#x6761;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x5185;&#x6838;&#x662F;&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x7269;&#x7406;&#x5185;&#x5B58;&#x7684;&#x5462;&#xFF1F;</p>
<h2 id="&#x7269;&#x7406;&#x5185;&#x5B58;&#x7BA1;&#x7406;">&#x7269;&#x7406;&#x5185;&#x5B58;&#x7BA1;&#x7406;</h2>
<p>&#x5728;<code>Linux</code>&#x7CFB;&#x7EDF;&#x4E2D;&#x901A;&#x8FC7;&#x5206;&#x6BB5;&#x548C;&#x5206;&#x9875;&#x673A;&#x5236;&#xFF0C;&#x628A;&#x7269;&#x7406;&#x5185;&#x5B58;&#x5212;&#x5206; 4K &#x5927;&#x5C0F;&#x7684;&#x5185;&#x5B58;&#x9875; <code>Page</code>&#xFF08;&#x4E5F;&#x79F0;&#x4F5C;&#x9875;&#x6846;<code>Page Frame</code>&#xFF09;&#xFF0C;&#x7269;&#x7406;&#x5185;&#x5B58;&#x7684;&#x5206;&#x914D;&#x548C;&#x56DE;&#x6536;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x5185;&#x5B58;&#x9875;&#x8FDB;&#x884C;&#xFF0C;&#x628A;&#x7269;&#x7406;&#x5185;&#x5B58;&#x5206;&#x9875;&#x7BA1;&#x7406;&#x7684;&#x597D;&#x5904;&#x5927;&#x5927;&#x7684;&#x3002;</p>
<p>&#x5047;&#x5982;&#x7CFB;&#x7EDF;&#x8BF7;&#x6C42;&#x5C0F;&#x5757;&#x5185;&#x5B58;&#xFF0C;&#x53EF;&#x4EE5;&#x9884;&#x5148;&#x5206;&#x914D;&#x4E00;&#x9875;&#x7ED9;&#x5B83;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x53CD;&#x590D;&#x7684;&#x7533;&#x8BF7;&#x548C;&#x91CA;&#x653E;&#x5C0F;&#x5757;&#x5185;&#x5B58;&#x5E26;&#x6765;&#x9891;&#x7E41;&#x7684;&#x7CFB;&#x7EDF;&#x5F00;&#x9500;&#x3002;</p>
<p>&#x5047;&#x5982;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x5927;&#x5757;&#x5185;&#x5B58;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x7528;&#x591A;&#x9875;&#x5185;&#x5B58;&#x62FC;&#x51D1;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x8981;&#x6C42;&#x5927;&#x5757;&#x8FDE;&#x7EED;&#x5185;&#x5B58;&#x3002;&#x4F60;&#x770B;&#x4E0D;&#x7BA1;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x90FD;&#x80FD;&#x6536;&#x653E;&#x81EA;&#x5982;&#xFF0C;&#x5206;&#x9875;&#x673A;&#x5236;&#x591A;&#x4E48;&#x5B8C;&#x7F8E;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF01;</p>
<p> <img src="https://i04piccdn.sogoucdn.com/615d4aeb28926430" alt=""> </p>
<p>But&#xFF0C;&#x7406;&#x60F3;&#x5F88;&#x4E30;&#x6EE1;&#xFF0C;&#x73B0;&#x5B9E;&#x5F88;&#x9AA8;&#x611F;&#x3002;&#x5982;&#x679C;&#x5C31;&#x76F4;&#x63A5;&#x8FD9;&#x6837;&#x628A;&#x5185;&#x5B58;&#x5206;&#x9875;&#x4F7F;&#x7528;&#xFF0C;&#x4E0D;&#x518D;&#x52A0;&#x989D;&#x5916;&#x7684;&#x7BA1;&#x7406;&#x8FD8;&#x662F;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E0B;&#xFF0C;&#x7CFB;&#x7EDF;&#x5728;&#x591A;&#x6B21;&#x5206;&#x914D;&#x548C;&#x91CA;&#x653E;&#x7269;&#x7406;&#x9875;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x9047;&#x5230;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x7269;&#x7406;&#x9875;&#x7BA1;&#x7406;&#x9762;&#x4E34;&#x95EE;&#x9898;">&#x7269;&#x7406;&#x9875;&#x7BA1;&#x7406;&#x9762;&#x4E34;&#x95EE;&#x9898;</h3>
<p>&#x7269;&#x7406;&#x5185;&#x5B58;&#x9875;&#x5206;&#x914D;&#x4F1A;&#x51FA;&#x73B0;&#x5916;&#x90E8;&#x788E;&#x7247;&#x548C;&#x5185;&#x90E8;&#x788E;&#x7247;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x8C13;&#x7684;&#x300C;&#x5185;&#x90E8;&#x300D;&#x548C;&#x300C;&#x5916;&#x90E8;&#x300D;&#x662F;&#x9488;&#x5BF9;&#x300C;&#x9875;&#x6846;&#x5185;&#x5916;&#x300D;&#x800C;&#x8A00;&#xFF0C;&#x4E00;&#x4E2A;&#x9875;&#x6846;&#x5185;&#x7684;&#x5185;&#x5B58;&#x788E;&#x7247;&#x662F;&#x5185;&#x90E8;&#x788E;&#x7247;&#xFF0C;&#x591A;&#x4E2A;&#x9875;&#x6846;&#x95F4;&#x7684;&#x788E;&#x7247;&#x662F;&#x5916;&#x90E8;&#x788E;&#x7247;&#x3002;</p>
<h4 id="&#x5916;&#x90E8;&#x788E;&#x7247;">&#x5916;&#x90E8;&#x788E;&#x7247;</h4>
<p>&#x5F53;&#x9700;&#x8981;&#x5206;&#x914D;&#x5927;&#x5757;&#x5185;&#x5B58;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x7528;&#x597D;&#x51E0;&#x9875;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x624D;&#x591F;&#xFF0C;&#x800C;&#x7CFB;&#x7EDF;&#x5206;&#x914D;&#x7269;&#x7406;&#x5185;&#x5B58;&#x9875;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x5C3D;&#x91CF;&#x5206;&#x914D;&#x8FDE;&#x7EED;&#x7684;&#x5185;&#x5B58;&#x9875;&#x9762;&#xFF0C;&#x9891;&#x7E41;&#x7684;&#x5206;&#x914D;&#x4E0E;&#x56DE;&#x6536;&#x7269;&#x7406;&#x9875;&#x5BFC;&#x81F4;&#x5927;&#x91CF;&#x7684;&#x5C0F;&#x5757;&#x5185;&#x5B58;&#x5939;&#x6742;&#x5728;&#x5DF2;&#x5206;&#x914D;&#x9875;&#x9762;&#x4E2D;&#x95F4;&#xFF0C;&#x5F62;&#x6210;&#x5916;&#x90E8;&#x788E;&#x7247;&#xFF0C;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<p><img src="https://upload-images.jianshu.io/upload_images/7842464-39b54d3f1acf2f86.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x5916;&#x90E8;&#x788E;&#x7247;"></p>
<h4 id="&#x5185;&#x90E8;&#x788E;&#x7247;">&#x5185;&#x90E8;&#x788E;&#x7247;</h4>
<p>&#x7269;&#x7406;&#x5185;&#x5B58;&#x662F;&#x6309;&#x9875;&#x6765;&#x5206;&#x914D;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x5F53;&#x5B9E;&#x9645;&#x53EA;&#x9700;&#x8981;&#x5F88;&#x5C0F;&#x5185;&#x5B58;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x4F1A;&#x5206;&#x914D;&#x81F3;&#x5C11;&#x662F; 4K &#x5927;&#x5C0F;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x800C;&#x5185;&#x6838;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x9700;&#x8981;&#x4EE5;&#x5B57;&#x8282;&#x4E3A;&#x5355;&#x4F4D;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x8FD9;&#x6837;&#x672C;&#x6765;&#x53EA;&#x60F3;&#x8981;&#x51E0;&#x4E2A;&#x5B57;&#x8282;&#x800C;&#x5DF2;&#x5374;&#x4E0D;&#x5F97;&#x4E0D;&#x5206;&#x914D;&#x4E00;&#x9875;&#x5185;&#x5B58;&#xFF0C;&#x9664;&#x53BB;&#x7528;&#x6389;&#x7684;&#x5B57;&#x8282;&#x5269;&#x4E0B;&#x7684;&#x5C31;&#x5F62;&#x6210;&#x4E86;&#x5185;&#x90E8;&#x788E;&#x7247;&#x3002; </p>
<p><img src="https://upload-images.jianshu.io/upload_images/7842464-496b0cfd4d779633.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x5185;&#x90E8;&#x788E;&#x7247;"></p>
<h3 id="&#x9875;&#x9762;&#x7BA1;&#x7406;&#x7B97;&#x6CD5;">&#x9875;&#x9762;&#x7BA1;&#x7406;&#x7B97;&#x6CD5;</h3>
<p>&#x65B9;&#x6CD5;&#x603B;&#x6BD4;&#x56F0;&#x96BE;&#x591A;&#xFF0C;&#x56E0;&#x4E3A;&#x5B58;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x806A;&#x660E;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x7075;&#x673A;&#x4E00;&#x52A8;&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x9875;&#x9762;&#x7BA1;&#x7406;&#x7B97;&#x6CD5;&#x6765;&#x89E3;&#x51B3;&#x4E0A;&#x8FF0;&#x7684;&#x788E;&#x7247;&#x95EE;&#x9898;&#x3002;</p>
<h4 id="buddy&#xFF08;&#x4F19;&#x4F34;&#xFF09;&#x5206;&#x914D;&#x7B97;&#x6CD5;">Buddy&#xFF08;&#x4F19;&#x4F34;&#xFF09;&#x5206;&#x914D;&#x7B97;&#x6CD5;</h4>
<p> <code>Linux</code> &#x5185;&#x6838;&#x5F15;&#x5165;&#x4E86;&#x4F19;&#x4F34;&#x7CFB;&#x7EDF;&#x7B97;&#x6CD5;&#xFF08;Buddy system&#xFF09;&#xFF0C;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF1F;&#x5C31;&#x662F;&#x628A;&#x76F8;&#x540C;&#x5927;&#x5C0F;&#x7684;&#x9875;&#x6846;&#x5757;&#x7528;&#x94FE;&#x8868;&#x4E32;&#x8D77;&#x6765;&#xFF0C;&#x9875;&#x6846;&#x5757;&#x5C31;&#x50CF;&#x624B;&#x62C9;&#x624B;&#x7684;&#x597D;&#x4F19;&#x4F34;&#xFF0C;&#x4E5F;&#x662F;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x540D;&#x5B57;&#x7684;&#x7531;&#x6765;&#x3002;</p>
<p> <img src="https://i04piccdn.sogoucdn.com/3182f7a569acc1c1" alt=""> </p>
<p>&#x5177;&#x4F53;&#x7684;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x7A7A;&#x95F2;&#x9875;&#x6846;&#x5206;&#x7EC4;&#x4E3A;11&#x4E2A;&#x5757;&#x94FE;&#x8868;&#xFF0C;&#x6BCF;&#x4E2A;&#x5757;&#x94FE;&#x8868;&#x5206;&#x522B;&#x5305;&#x542B;&#x5927;&#x5C0F;&#x4E3A;1&#xFF0C;2&#xFF0C;4&#xFF0C;8&#xFF0C;16&#xFF0C;32&#xFF0C;64&#xFF0C;128&#xFF0C;256&#xFF0C;512&#x548C;1024&#x4E2A;&#x8FDE;&#x7EED;&#x9875;&#x6846;&#x7684;&#x9875;&#x6846;&#x5757;&#x3002;&#x6700;&#x5927;&#x53EF;&#x4EE5;&#x7533;&#x8BF7;1024&#x4E2A;&#x8FDE;&#x7EED;&#x9875;&#x6846;&#xFF0C;&#x5BF9;&#x5E94;4MB&#x5927;&#x5C0F;&#x7684;&#x8FDE;&#x7EED;&#x5185;&#x5B58;&#x3002;</p>
<p><img src="https://upload-images.jianshu.io/upload_images/7842464-25a3e9bd900cb55c.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x4F19;&#x4F34;&#x7CFB;&#x7EDF;"></p>
<p>&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x6B63;&#x6574;&#x6570;&#x90FD;&#x53EF;&#x4EE5;&#x7531; <code>2^n</code> &#x7684;&#x548C;&#x7EC4;&#x6210;&#xFF0C;&#x6240;&#x4EE5;&#x603B;&#x80FD;&#x627E;&#x5230;&#x5408;&#x9002;&#x5927;&#x5C0F;&#x7684;&#x5185;&#x5B58;&#x5757;&#x5206;&#x914D;&#x51FA;&#x53BB;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x5916;&#x90E8;&#x788E;&#x7247;&#x4EA7;&#x751F; &#x3002;</p>
<h5 id="&#x5206;&#x914D;&#x5B9E;&#x4F8B;">&#x5206;&#x914D;&#x5B9E;&#x4F8B;</h5>
<p>&#x6BD4;&#x5982;&#xFF1A;&#x6211;&#x9700;&#x8981;&#x7533;&#x8BF7;4&#x4E2A;&#x9875;&#x6846;&#xFF0C;&#x4F46;&#x662F;&#x957F;&#x5EA6;&#x4E3A;4&#x4E2A;&#x8FDE;&#x7EED;&#x9875;&#x6846;&#x5757;&#x94FE;&#x8868;&#x6CA1;&#x6709;&#x7A7A;&#x95F2;&#x7684;&#x9875;&#x6846;&#x5757;&#xFF0C;&#x4F19;&#x4F34;&#x7CFB;&#x7EDF;&#x4F1A;&#x4ECE;&#x8FDE;&#x7EED;8&#x4E2A;&#x9875;&#x6846;&#x5757;&#x7684;&#x94FE;&#x8868;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x62C6;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x8FDE;&#x7EED;4&#x4E2A;&#x9875;&#x6846;&#x5757;&#xFF0C;&#x53D6;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x653E;&#x5165;&#x8FDE;&#x7EED;4&#x4E2A;&#x9875;&#x6846;&#x5757;&#x7684;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#x4E2D;&#x3002;&#x91CA;&#x653E;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x68C0;&#x67E5;&#xFF0C;&#x91CA;&#x653E;&#x7684;&#x8FD9;&#x51E0;&#x4E2A;&#x9875;&#x6846;&#x524D;&#x540E;&#x7684;&#x9875;&#x6846;&#x662F;&#x5426;&#x7A7A;&#x95F2;&#xFF0C;&#x80FD;&#x5426;&#x7EC4;&#x6210;&#x4E0B;&#x4E00;&#x7EA7;&#x957F;&#x5EA6;&#x7684;&#x5757;&#x3002; </p>
<h5 id="&#x547D;&#x4EE4;&#x67E5;&#x770B;">&#x547D;&#x4EE4;&#x67E5;&#x770B;</h5>
<pre><code>[lemon]]# cat /proc/buddyinfo 
Node 0, zone      DMA      1      0      0      0      2      1      1      0      1      1      3 
Node 0, zone    DMA32   3198   4108   4940   4773   4030   2184    891    180     67     32    330 
Node 0, zone   Normal  42438  37404  16035   4386    610    121     22      3      0      0      1
</code></pre><h4 id="slab&#x5206;&#x914D;&#x5668;">slab&#x5206;&#x914D;&#x5668;</h4>
<p>&#x770B;&#x5230;&#x8FD9;&#x91CC;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#xFF0C;&#x6709;&#x4E86;&#x4F19;&#x4F34;&#x7CFB;&#x7EDF;&#x8FD9;&#x4E0B;&#x603B;&#x53EF;&#x4EE5;&#x7BA1;&#x7406;&#x597D;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E86;&#x5427;&#xFF1F;&#x4E0D;&#xFF0C;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x6CA1;&#x6709;slab&#x5206;&#x914D;&#x5668;&#x4EC0;&#x4E48;&#x4E8B;&#x4E86;&#x3002;</p>
<p> <img src="https://i02piccdn.sogoucdn.com/980b9721e70eedae" alt=""> </p>
<p>&#x90A3;&#x4EC0;&#x4E48;&#x662F;slab&#x5206;&#x914D;&#x5668;&#x5462;&#xFF1F;</p>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5185;&#x6838;&#x5BF9;&#x8C61;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;&#x5206;&#x914D;&#x5185;&#x5B58;-&#x521D;&#x59CB;&#x5316;-&#x91CA;&#x653E;&#x5185;&#x5B58;&#xFF0C;&#x5185;&#x6838;&#x4E2D;&#x6709;&#x5927;&#x91CF;&#x7684;&#x5C0F;&#x5BF9;&#x8C61;&#xFF0C;&#x6BD4;&#x5982;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7ED3;&#x6784;&#x5BF9;&#x8C61;&#x3001;&#x4EFB;&#x52A1;&#x63CF;&#x8FF0;&#x7ED3;&#x6784;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#x679C;&#x6309;&#x7167;&#x4F19;&#x4F34;&#x7CFB;&#x7EDF;&#x6309;&#x9875;&#x5206;&#x914D;&#x548C;&#x91CA;&#x653E;&#x5185;&#x5B58;&#xFF0C;&#x5BF9;&#x5C0F;&#x5BF9;&#x8C61;&#x9891;&#x7E41;&#x7684;&#x6267;&#x884C;&#x300C;&#x5206;&#x914D;&#x5185;&#x5B58;-&#x521D;&#x59CB;&#x5316;-&#x91CA;&#x653E;&#x5185;&#x5B58;&#x300D;&#x4F1A;&#x975E;&#x5E38;&#x6D88;&#x8017;&#x6027;&#x80FD;&#x3002;</p>
<p>&#x4F19;&#x4F34;&#x7CFB;&#x7EDF;&#x5206;&#x914D;&#x51FA;&#x53BB;&#x7684;&#x5185;&#x5B58;&#x8FD8;&#x662F;&#x4EE5;&#x9875;&#x6846;&#x4E3A;&#x5355;&#x4F4D;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x5185;&#x6838;&#x7684;&#x5F88;&#x591A;&#x573A;&#x666F;&#x90FD;&#x662F;&#x5206;&#x914D;&#x5C0F;&#x7247;&#x5185;&#x5B58;&#xFF0C;&#x8FDC;&#x7528;&#x4E0D;&#x5230;&#x4E00;&#x9875;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x7684;&#x7A7A;&#x95F4;&#x3002;<code>slab</code>&#x5206;&#x914D;&#x5668;&#xFF0C;<strong>&#x901A;&#x8FC7;&#x5C06;&#x5185;&#x5B58;&#x6309;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x4E0D;&#x540C;&#x518D;&#x5212;&#x5206;&#x6210;&#x4E0D;&#x540C;&#x5927;&#x5C0F;&#x7684;&#x7A7A;&#x95F4;</strong>&#xFF0C;&#x5E94;&#x7528;&#x4E8E;&#x5185;&#x6838;&#x5BF9;&#x8C61;&#x7684;&#x7F13;&#x5B58;&#x3002;</p>
<p>&#x4F19;&#x4F34;&#x7CFB;&#x7EDF;&#x548C;slab&#x4E0D;&#x662F;&#x4E8C;&#x9009;&#x4E00;&#x7684;&#x5173;&#x7CFB;&#xFF0C;<code>slab</code> &#x5185;&#x5B58;&#x5206;&#x914D;&#x5668;&#x662F;&#x5BF9;&#x4F19;&#x4F34;&#x5206;&#x914D;&#x7B97;&#x6CD5;&#x7684;&#x8865;&#x5145;&#x3002;</p>
<h5 id="&#x5927;&#x767D;&#x8BDD;&#x8BF4;&#x539F;&#x7406;">&#x5927;&#x767D;&#x8BDD;&#x8BF4;&#x539F;&#x7406;</h5>
<p>&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x5185;&#x6838;&#x4E2D;&#x7684;&#x76F8;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#xFF1A;<code>task_struct&#x3001;file_struct</code> &#x7B49;&#x9700;&#x8981;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x7684;&#x5C0F;&#x578B;&#x5185;&#x6838;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x4E2A; slab &#x7F13;&#x5B58;&#x6C60;&#xFF0C;&#x7F13;&#x5B58;&#x4F4F;&#x5927;&#x91CF;&#x5E38;&#x7528;&#x7684;&#x300C;&#x5DF2;&#x7ECF;&#x521D;&#x59CB;&#x5316;&#x300D;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x6BCF;&#x5F53;&#x8981;&#x7533;&#x8BF7;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x5C31;&#x4ECE;&#x7F13;&#x5B58;&#x6C60;&#x7684;<code>slab</code> &#x5217;&#x8868;&#x4E2D;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x51FA;&#x53BB;&#xFF1B;&#x800C;&#x5F53;&#x8981;&#x91CA;&#x653E;&#x65F6;&#xFF0C;&#x5C06;&#x5176;&#x91CD;&#x65B0;&#x4FDD;&#x5B58;&#x5728;&#x8BE5;&#x5217;&#x8868;&#x4E2D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x7ED9;&#x4F19;&#x4F34;&#x7CFB;&#x7EDF;&#xFF0C;&#x4ECE;&#x800C;&#x907F;&#x514D;&#x5185;&#x90E8;&#x788E;&#x7247;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x4E86;&#x5185;&#x5B58;&#x5206;&#x914D;&#x6027;&#x80FD;&#x3002;</p>
<h5 id="&#x4E3B;&#x8981;&#x4F18;&#x70B9;">&#x4E3B;&#x8981;&#x4F18;&#x70B9;</h5>
<ul>
<li><code>slab</code> &#x5185;&#x5B58;&#x7BA1;&#x7406;&#x57FA;&#x4E8E;&#x5185;&#x6838;&#x5C0F;&#x5BF9;&#x8C61;&#xFF0C;&#x4E0D;&#x7528;&#x6BCF;&#x6B21;&#x90FD;&#x5206;&#x914D;&#x4E00;&#x9875;&#x5185;&#x5B58;&#xFF0C;&#x5145;&#x5206;&#x5229;&#x7528;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x907F;&#x514D;&#x5185;&#x90E8;&#x788E;&#x7247;&#x3002;</li>
<li><code>slab</code> &#x5BF9;&#x5185;&#x6838;&#x4E2D;&#x9891;&#x7E41;&#x521B;&#x5EFA;&#x548C;&#x91CA;&#x653E;&#x7684;&#x5C0F;&#x5BF9;&#x8C61;&#x505A;&#x7F13;&#x5B58;&#xFF0C;&#x91CD;&#x590D;&#x5229;&#x7528;&#x4E00;&#x4E9B;&#x76F8;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x5206;&#x914D;&#x6B21;&#x6570;&#x3002;</li>
</ul>
<h5 id="&#x6570;&#x636E;&#x7ED3;&#x6784;">&#x6570;&#x636E;&#x7ED3;&#x6784;</h5>
<p><img src="https://upload-images.jianshu.io/upload_images/7842464-d3d1a3ed84ac2960.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="slab&#x5206;&#x914D;&#x5668;"></p>
<p><code>kmem_cache</code> &#x662F;&#x4E00;&#x4E2A;<code>cache_chain</code> &#x7684;&#x94FE;&#x8868;&#x7EC4;&#x6210;&#x8282;&#x70B9;&#xFF0C;&#x4EE3;&#x8868;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x6838;&#x4E2D;&#x7684;&#x76F8;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x300C;&#x5BF9;&#x8C61;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x300D;&#xFF0C;&#x6BCF;&#x4E2A;<code>kmem_cache</code> &#x901A;&#x5E38;&#x662F;&#x4E00;&#x6BB5;&#x8FDE;&#x7EED;&#x7684;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x4E09;&#x79CD;&#x7C7B;&#x578B;&#x7684; <code>slabs</code> &#x94FE;&#x8868;&#xFF1A;</p>
<ul>
<li><code>slabs_full</code> (&#x5B8C;&#x5168;&#x5206;&#x914D;&#x7684; <code>slab</code> &#x94FE;&#x8868;)</li>
<li><code>slabs_partial</code> (&#x90E8;&#x5206;&#x5206;&#x914D;&#x7684;<code>slab</code> &#x94FE;&#x8868;)</li>
<li><code>slabs_empty</code> ( &#x6CA1;&#x6709;&#x88AB;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x7684;<code>slab</code> &#x94FE;&#x8868;)</li>
</ul>
<p><code>kmem_cache</code> &#x4E2D;&#x6709;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x7ED3;&#x6784;&#x4F53; <code>kmem_list3</code> &#x5305;&#x542B;&#x4E86;&#x4EE5;&#x4E0A;&#x4E09;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x58F0;&#x660E;&#x3002; </p>
<p><img src="https://upload-images.jianshu.io/upload_images/7842464-ff27149b346c7f1b.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="kmem_list3 &#x5185;&#x6838;&#x6E90;&#x7801;"></p>
<p><code>slab</code> &#x662F;<code>slab</code> &#x5206;&#x914D;&#x5668;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#xFF0C;&#x5728;&#x5B9E;&#x73B0;&#x4E0A;&#x4E00;&#x4E2A; <code>slab</code> &#x6709;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8FDE;&#x7EED;&#x7684;&#x7269;&#x7406;&#x9875;&#x7EC4;&#x6210;&#xFF08;&#x901A;&#x5E38;&#x53EA;&#x6709;&#x4E00;&#x9875;&#xFF09;&#x3002;&#x5355;&#x4E2A;slab&#x53EF;&#x4EE5;&#x5728; <code>slab</code> &#x94FE;&#x8868;&#x4E4B;&#x95F4;&#x79FB;&#x52A8;&#xFF0C;&#x4F8B;&#x5982;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x300C;&#x534A;&#x6EE1;<code>slabs_partial</code>&#x94FE;&#x8868;&#x300D;&#x88AB;&#x5206;&#x914D;&#x4E86;&#x5BF9;&#x8C61;&#x540E;&#x53D8;&#x6EE1;&#x4E86;&#xFF0C;&#x5C31;&#x8981;&#x4ECE; <code>slabs_partial</code> &#x4E2D;&#x5220;&#x9664;&#xFF0C;&#x540C;&#x65F6;&#x63D2;&#x5165;&#x5230;&#x300C;&#x5168;&#x6EE1;<code>slabs_full</code>&#x94FE;&#x8868;&#x300D;&#x4E2D;&#x53BB;&#x3002;&#x5185;&#x6838;<code>slab</code>&#x5BF9;&#x8C61;&#x7684;&#x5206;&#x914D;&#x8FC7;&#x7A0B;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<ol>
<li>&#x5982;&#x679C;<code>slabs_partial</code>&#x94FE;&#x8868;&#x8FD8;&#x6709;&#x672A;&#x5206;&#x914D;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#xFF0C;&#x82E5;&#x5206;&#x914D;&#x4E4B;&#x540E;&#x53D8;&#x6EE1;&#xFF0C;&#x79FB;&#x52A8; <code>slab</code> &#x5230;<code>slabs_full</code> &#x94FE;&#x8868;</li>
<li>&#x5982;&#x679C;<code>slabs_partial</code>&#x94FE;&#x8868;&#x6CA1;&#x6709;&#x672A;&#x5206;&#x914D;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x8FDB;&#x5165;&#x4E0B;&#x4E00;&#x6B65;</li>
<li>&#x5982;&#x679C;<code>slabs_empty</code> &#x94FE;&#x8868;&#x8FD8;&#x6709;&#x672A;&#x5206;&#x914D;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#xFF0C;&#x540C;&#x65F6;&#x79FB;&#x52A8;<code>slab</code>&#x8FDB;&#x5165;<code>slabs_partial</code>&#x94FE;&#x8868;</li>
<li>&#x5982;&#x679C;<code>slabs_empty</code>&#x4E3A;&#x7A7A;&#xFF0C;&#x8BF7;&#x6C42;&#x4F19;&#x4F34;&#x7CFB;&#x7EDF;&#x5206;&#x9875;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7A7A;&#x95F2;<code>slab</code>&#xFF0C; &#x6309;&#x6B65;&#x9AA4; 3 &#x5206;&#x914D;&#x5BF9;&#x8C61;</li>
</ol>
<p><img src="https://upload-images.jianshu.io/upload_images/7842464-e830d87e9bd2cba0.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="slab&#x5206;&#x914D;&#x56FE;&#x89E3;"></p>
<h5 id="&#x547D;&#x4EE4;&#x67E5;&#x770B;">&#x547D;&#x4EE4;&#x67E5;&#x770B;</h5>
<p>&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x90FD;&#x662F;&#x7406;&#x8BBA;&#xFF0C;&#x6BD4;&#x8F83;&#x62BD;&#x8C61;&#xFF0C;&#x52A8;&#x52A8;&#x624B;&#x6765;&#x5EB7;&#x5EB7;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684; slab &#x5427;&#xFF01;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <code>cat /proc/slabinfo</code> &#x547D;&#x4EE4;&#xFF0C;&#x5B9E;&#x9645;&#x67E5;&#x770B;&#x7CFB;&#x7EDF;&#x4E2D;<code>slab</code> &#x4FE1;&#x606F;&#x3002;</p>
<p><img src="https://upload-images.jianshu.io/upload_images/7842464-1a310d5b729d0a25.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="slabinfo&#x67E5;&#x8BE2;"></p>
<p><code>slabtop</code>  &#x5B9E;&#x65F6;&#x663E;&#x793A;&#x5185;&#x6838; slab &#x5185;&#x5B58;&#x7F13;&#x5B58;&#x4FE1;&#x606F;&#x3002;</p>
<p><img src="https://upload-images.jianshu.io/upload_images/7842464-69926181eda4d902.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="slabtop&#x67E5;&#x8BE2;"></p>
<h4 id="slab&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x7684;&#x5206;&#x7C7B;">slab&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x7684;&#x5206;&#x7C7B;</h4>
<p>slab&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x5206;&#x4E3A;&#x4E24;&#x5927;&#x7C7B;&#xFF0C;&#x300C;&#x901A;&#x7528;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x300D;&#x548C;&#x300C;&#x4E13;&#x7528;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x300D;&#x3002;</p>
<h5 id="&#x901A;&#x7528;&#x9AD8;&#x901F;&#x7F13;&#x5B58;">&#x901A;&#x7528;&#x9AD8;&#x901F;&#x7F13;&#x5B58;</h5>
<p>slab&#x5206;&#x914D;&#x5668;&#x4E2D;&#x7528; <code>kmem_cache</code> &#x6765;&#x63CF;&#x8FF0;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x4E5F;&#x9700;&#x8981; slab &#x5206;&#x914D;&#x5668;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x3002;cache_cache &#x4FDD;&#x5B58;&#x7740;&#x5BF9;&#x300C;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x63CF;&#x8FF0;&#x7B26;&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x300D;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x901A;&#x7528;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#xFF0C;&#x4FDD;&#x5B58;&#x5728;<code>cache_chain</code> &#x94FE;&#x8868;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;slab &#x5206;&#x914D;&#x5668;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x5C0F;&#x5757;&#x8FDE;&#x7EED;&#x5185;&#x5B58;&#x7684;&#x5206;&#x914D;&#xFF0C;&#x4E5F;&#x662F;&#x901A;&#x7528;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x901A;&#x7528;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x5BF9;&#x8C61;&#x5177;&#x6709;&#x51E0;&#x4F55;&#x5206;&#x5E03;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x8303;&#x56F4;&#x4E3A;32&#x5230;131072&#x5B57;&#x8282;&#x3002;&#x5185;&#x6838;&#x4E2D;&#x63D0;&#x4F9B;&#x4E86; <code>kmalloc()</code> &#x548C; <code>kfree()</code> &#x4E24;&#x4E2A;&#x63A5;&#x53E3;&#x5206;&#x522B;&#x8FDB;&#x884C;&#x5185;&#x5B58;&#x7684;&#x7533;&#x8BF7;&#x548C;&#x91CA;&#x653E;&#x3002;</p>
<h5 id="&#x4E13;&#x7528;&#x9AD8;&#x901F;&#x7F13;&#x5B58;">&#x4E13;&#x7528;&#x9AD8;&#x901F;&#x7F13;&#x5B58;</h5>
<p>&#x5185;&#x6838;&#x4E3A;&#x4E13;&#x7528;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x7684;&#x7533;&#x8BF7;&#x548C;&#x91CA;&#x653E;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x5957;&#x5B8C;&#x6574;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x6839;&#x636E;&#x6240;&#x4F20;&#x5165;&#x7684;&#x53C2;&#x6570;&#x4E3A;&#x5236;&#x5B9A;&#x7684;&#x5BF9;&#x8C61;&#x5206;&#x914D;slab&#x7F13;&#x5B58;&#x3002;</p>
<h6 id="&#x4E13;&#x7528;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x7684;&#x7533;&#x8BF7;&#x548C;&#x91CA;&#x653E;">&#x4E13;&#x7528;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x7684;&#x7533;&#x8BF7;&#x548C;&#x91CA;&#x653E;</h6>
<p>kmem_cache_create() &#x7528;&#x4E8E;&#x5BF9;&#x4E00;&#x4E2A;&#x6307;&#x5B9A;&#x7684;&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x3002;&#x5B83;&#x4ECE; cache_cache &#x666E;&#x901A;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x4E2D;&#x4E3A;&#x65B0;&#x7684;&#x4E13;&#x6709;&#x7F13;&#x5B58;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x63CF;&#x8FF0;&#x7B26;&#xFF0C;&#x5E76;&#x628A;&#x8FD9;&#x4E2A;&#x63CF;&#x8FF0;&#x7B26;&#x63D2;&#x5165;&#x5230;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x63CF;&#x8FF0;&#x7B26;&#x5F62;&#x6210;&#x7684; cache_chain &#x94FE;&#x8868;&#x4E2D;&#x3002;kmem_cache_destory() &#x7528;&#x4E8E;&#x64A4;&#x6D88;&#x548C;&#x4ECE; cache_chain &#x94FE;&#x8868;&#x4E0A;&#x5220;&#x9664;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x3002;</p>
<h5 id="slab&#x7684;&#x7533;&#x8BF7;&#x548C;&#x91CA;&#x653E;">slab&#x7684;&#x7533;&#x8BF7;&#x548C;&#x91CA;&#x653E;</h5>
<p><code>slab</code> &#x6570;&#x636E;&#x7ED3;&#x6784;&#x5728;&#x5185;&#x6838;&#x4E2D;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="https://upload-images.jianshu.io/upload_images/7842464-8f1e770cb728e37e.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="slab&#x7ED3;&#x6784;&#x4F53;&#x5185;&#x6838;&#x4EE3;&#x7801;"></p>
<p>kmem_cache_alloc() &#x5728;&#x5176;&#x53C2;&#x6570;&#x6240;&#x6307;&#x5B9A;&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x4E2D;&#x5206;&#x914D;&#x4E00;&#x4E2A;slab&#xFF0C;&#x5BF9;&#x5E94;&#x7684; kmem_cache_free() &#x5728;&#x5176;&#x53C2;&#x6570;&#x6240;&#x6307;&#x5B9A;&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x4E2D;&#x91CA;&#x653E;&#x4E00;&#x4E2A;slab&#x3002;</p>
<h2 id="&#x865A;&#x62DF;&#x5185;&#x5B58;&#x5206;&#x914D;">&#x865A;&#x62DF;&#x5185;&#x5B58;&#x5206;&#x914D;</h2>
<p>&#x524D;&#x9762;&#x8BA8;&#x8BBA;&#x7684;&#x90FD;&#x662F;&#x5BF9;&#x7269;&#x7406;&#x5185;&#x5B58;&#x7684;&#x7BA1;&#x7406;&#xFF0C;Linux &#x901A;&#x8FC7;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#xFF0C;&#x6B3A;&#x9A97;&#x4E86;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x5047;&#x88C5;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x90FD;&#x6709; 4G &#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x5BFB;&#x5740;&#x7A7A;&#x95F4;&#xFF08;&#x5982;&#x679C;&#x8FD9;&#x91CC;&#x4E0D;&#x61C2;&#x6211;&#x8BF4;&#x5565;&#xFF0C;&#x5EFA;&#x8BAE;&#x56DE;&#x5934;&#x770B;&#x4E0B; <a href="https://mp.weixin.qq.com/s?__biz=MzIwMjM4NDE1Nw==&amp;mid=2247483865&amp;idx=1&amp;sn=dfa63a467b620b6131acaef9ea6874a3&amp;chksm=96de37aba1a9bebdcc097314f40ae633bd393253759ecd970ac84cdb41f18994da9405dbf356&amp;token=1178579599&amp;lang=zh_CN#rd" target="_blank">&#x522B;&#x518D;&#x8BF4;&#x4F60;&#x4E0D;&#x61C2;Linux&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x4E86;&#xFF0C;10&#x5F20;&#x56FE;&#x7ED9;&#x4F60;&#x5B89;&#x6392;&#x7684;&#x660E;&#x660E;&#x767D;&#x767D;&#xFF01;</a>&#xFF09;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x6765;&#x7814;&#x7A76;&#x4E0B;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7684;&#x5206;&#x914D;&#xFF0C;&#x8FD9;&#x91CC;&#x5305;&#x62EC;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x548C;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;&#xFF0C;&#x5206;&#x914D;&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x8FD8;&#x6CA1;&#x6709;&#x6620;&#x5C04;&#x5230;&#x7269;&#x7406;&#x5185;&#x5B58;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x8BBF;&#x95EE;&#x7533;&#x8BF7;&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x624D;&#x4F1A;&#x53D1;&#x751F;&#x7F3A;&#x9875;&#x5F02;&#x5E38;&#xFF0C;&#x518D;&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x4ECB;&#x7ECD;&#x7684;&#x4F19;&#x4F34;&#x7CFB;&#x7EDF;&#x548C; slab &#x5206;&#x914D;&#x5668;&#x7533;&#x8BF7;&#x7269;&#x7406;&#x5185;&#x5B58;&#x3002;</strong></p>
<h3 id="&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x5185;&#x5B58;&#x5206;&#x914D;">&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x5185;&#x5B58;&#x5206;&#x914D;</h3>
<h4 id="malloc">malloc</h4>
<p><code>malloc</code> &#x7528;&#x4E8E;&#x7533;&#x8BF7;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#xFF0C;&#x5F53;&#x7533;&#x8BF7;&#x5C0F;&#x4E8E; <code>128KB</code> &#x5C0F;&#x5185;&#x5B58;&#x7684;&#x65F6;&#xFF0C;<code>malloc</code>&#x4F7F;&#x7528;  <code>sbrk&#x6216;brk</code> &#x5206;&#x914D;&#x5185;&#x5B58;&#xFF1B;&#x5F53;&#x7533;&#x8BF7;&#x5927;&#x4E8E; <code>128KB</code> &#x7684;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x4F7F;&#x7528; <code>mmap</code> &#x51FD;&#x6570;&#x7533;&#x8BF7;&#x5185;&#x5B58;&#xFF1B; </p>
<h5 id="&#x5B58;&#x5728;&#x95EE;&#x9898;">&#x5B58;&#x5728;&#x95EE;&#x9898;</h5>
<p>&#x7531;&#x4E8E; <code>brk/sbrk/mmap</code> &#x5C5E;&#x4E8E;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x6B21;&#x7533;&#x8BF7;&#x5185;&#x5B58;&#x90FD;&#x8981;&#x4EA7;&#x751F;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x5F00;&#x9500;&#xFF0C;<code>cpu</code> &#x5728;&#x7528;&#x6237;&#x6001;&#x548C;&#x5185;&#x6838;&#x6001;&#x4E4B;&#x95F4;&#x9891;&#x7E41;&#x5207;&#x6362;&#xFF0C;&#x975E;&#x5E38;&#x5F71;&#x54CD;&#x6027;&#x80FD;&#x3002;</p>
<p>&#x800C;&#x4E14;&#xFF0C;&#x5806;&#x662F;&#x4ECE;&#x4F4E;&#x5730;&#x5740;&#x5F80;&#x9AD8;&#x5730;&#x5740;&#x589E;&#x957F;&#xFF0C;&#x5982;&#x679C;&#x4F4E;&#x5730;&#x5740;&#x7684;&#x5185;&#x5B58;&#x6CA1;&#x6709;&#x88AB;&#x91CA;&#x653E;&#xFF0C;&#x9AD8;&#x5730;&#x5740;&#x7684;&#x5185;&#x5B58;&#x5C31;&#x4E0D;&#x80FD;&#x88AB;&#x56DE;&#x6536;&#xFF0C;&#x5BB9;&#x6613;&#x4EA7;&#x751F;&#x5185;&#x5B58;&#x788E;&#x7247;&#x3002; </p>
<h5 id="&#x89E3;&#x51B3;">&#x89E3;&#x51B3;</h5>
<p>&#x56E0;&#x6B64;&#xFF0C;<code>malloc</code>&#x91C7;&#x7528;&#x7684;&#x662F;&#x5185;&#x5B58;&#x6C60;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#xFF0C;&#x5148;&#x7533;&#x8BF7;&#x4E00;&#x5927;&#x5757;&#x5185;&#x5B58;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5185;&#x5B58;&#x5206;&#x6210;&#x4E0D;&#x540C;&#x5927;&#x5C0F;&#x7684;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x6237;&#x7533;&#x8BF7;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x76F4;&#x63A5;&#x4ECE;&#x5185;&#x5B58;&#x6C60;&#x4E2D;&#x9009;&#x62E9;&#x4E00;&#x5757;&#x76F8;&#x8FD1;&#x7684;&#x5185;&#x5B58;&#x5757;&#x5206;&#x914D;&#x51FA;&#x53BB;&#x3002; 
<img src="https://upload-images.jianshu.io/upload_images/7842464-26e7d450551a4631.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="malloc&#x539F;&#x7406;"></p>
<h3 id="&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x5185;&#x5B58;&#x5206;&#x914D;">&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x5185;&#x5B58;&#x5206;&#x914D;</h3>
<p>&#x5728;&#x8BB2;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x5185;&#x5B58;&#x5206;&#x914D;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x6765;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x5185;&#x6838;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x3002;<code>kmalloc</code> &#x548C; <code>vmalloc</code> &#x5206;&#x522B;&#x7528;&#x4E8E;&#x5206;&#x914D;&#x4E0D;&#x540C;&#x6620;&#x5C04;&#x533A;&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x3002;</p>
<p><img src="https://imgconvert.csdnimg.cn/aHR0cHM6Ly91cGxvYWQtaW1hZ2VzLmppYW5zaHUuaW8vdXBsb2FkX2ltYWdlcy83ODQyNDY0LWZmZTNlNGQ4ZDc5ZjNmNGMucG5n?x-oss-process=image/format,png" alt="&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x7EC6;&#x5206;&#x533A;&#x57DF;."></p>
<h4 id="kmalloc">kmalloc</h4>
<p><code>kmalloc()</code> &#x5206;&#x914D;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#x8303;&#x56F4;&#x5728;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x7684;&#x300C;&#x76F4;&#x63A5;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x533A;&#x300D;&#x3002;</p>
<p>&#x6309;&#x5B57;&#x8282;&#x4E3A;&#x5355;&#x4F4D;&#x865A;&#x62DF;&#x5185;&#x5B58;&#xFF0C;&#x4E00;&#x822C;&#x7528;&#x4E8E;&#x5206;&#x914D;&#x5C0F;&#x5757;&#x5185;&#x5B58;&#xFF0C;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x5BF9;&#x5E94;&#x4E8E; <code>kfree</code> &#xFF0C;&#x53EF;&#x4EE5;&#x5206;&#x914D;&#x8FDE;&#x7EED;&#x7684;&#x7269;&#x7406;&#x5185;&#x5B58;&#x3002;&#x51FD;&#x6570;&#x539F;&#x578B;&#x5728; <code>&lt;linux/kmalloc.h&gt;</code> &#x4E2D;&#x58F0;&#x660E;&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x5728;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x4E2D;&#x90FD;&#x662F;&#x8C03;&#x7528; <code>kmalloc()</code> &#x6765;&#x7ED9;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5206;&#x914D;&#x5185;&#x5B58; &#x3002;</p>
<p>&#x8FD8;&#x8BB0;&#x5F97;&#x524D;&#x9762;&#x8BF4;&#x7684; slab &#x5417;&#xFF1F;<code>kmalloc</code> &#x662F;&#x57FA;&#x4E8E;slab &#x5206;&#x914D;&#x5668;&#x7684; &#xFF0C;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x7528;<code>cat /proc/slabinfo</code> &#x547D;&#x4EE4;&#xFF0C;&#x67E5;&#x770B; <code>kmalloc</code> &#x76F8;&#x5173; <code>slab</code>   &#x5BF9;&#x8C61;&#x4FE1;&#x606F;&#xFF0C;&#x4E0B;&#x9762;&#x7684; kmalloc-8&#x3001;kmalloc-16 &#x7B49;&#x7B49;&#x5C31;&#x662F;&#x57FA;&#x4E8E;slab&#x5206;&#x914D;&#x7684; kmalloc &#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x3002;</p>
<p><img src="https://upload-images.jianshu.io/upload_images/7842464-159cafcb9fca21cd.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="slabinfo-kmalloc"></p>
<h4 id="vmalloc">vmalloc</h4>
<p><code>vmalloc</code> &#x5206;&#x914D;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#x533A;&#x95F4;&#xFF0C;&#x4F4D;&#x4E8E; <code>vmalloc_start</code> &#x4E0E; <code>vmalloc_end</code> &#x4E4B;&#x95F4;&#x7684;&#x300C;&#x52A8;&#x6001;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x533A;&#x300D;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x7528;&#x5206;&#x914D;&#x5927;&#x5757;&#x5185;&#x5B58;&#xFF0C;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x5BF9;&#x5E94;&#x4E8E; <code>vfree</code>&#xFF0C;&#x5206;&#x914D;&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x5730;&#x5740;&#x8FDE;&#x7EED;&#xFF0C;&#x7269;&#x7406;&#x5730;&#x5740;&#x4E0A;&#x4E0D;&#x4E00;&#x5B9A;&#x8FDE;&#x7EED;&#x3002;&#x51FD;&#x6570;&#x539F;&#x578B;&#x5728; <code>&lt;linux/vmalloc.h&gt;</code> &#x4E2D;&#x58F0;&#x660E;&#x3002;&#x4E00;&#x822C;&#x7528;&#x5728;&#x4E3A;&#x6D3B;&#x52A8;&#x7684;&#x4EA4;&#x6362;&#x533A;&#x5206;&#x914D;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4E3A;&#x67D0;&#x4E9B; <code>I/O</code> &#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x5206;&#x914D;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x6216;&#x4E3A;&#x5185;&#x6838;&#x6A21;&#x5757;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7684;&#x56FE;&#x603B;&#x7ED3;&#x4E86;&#x4E0A;&#x8FF0;&#x4E24;&#x79CD;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x5206;&#x914D;&#x65B9;&#x5F0F;&#x3002;
<img src="https://upload-images.jianshu.io/upload_images/7842464-0479ee1ebb47e96f.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="kmalloc_vmalloc&#x56FE;&#x89E3;"></p>
<h2 id="&#x603B;&#x7ED3;&#x4E00;&#x4E0B;">&#x603B;&#x7ED3;&#x4E00;&#x4E0B;</h2>
<p>&#x8FD9;&#x662F;<code>Linux</code>&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x7684;&#x4E0B;&#x7BC7;&#xFF0C;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x9605;&#x8BFB;&#x8FC7;&#x7A0B;&#x4E2D;&#x6709;&#x4E0D;&#x6E05;&#x695A;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x5148;&#x53BB;&#x770B;&#x770B;&#x6211;&#x4E4B;&#x524D;&#x5199;&#x7684; <a href="https://mp.weixin.qq.com/s?__biz=MzIwMjM4NDE1Nw==&amp;mid=2247483865&amp;idx=1&amp;sn=dfa63a467b620b6131acaef9ea6874a3&amp;chksm=96de37aba1a9bebdcc097314f40ae633bd393253759ecd970ac84cdb41f18994da9405dbf356&amp;token=1178579599&amp;lang=zh_CN#rd" target="_blank">&#x522B;&#x518D;&#x8BF4;&#x4F60;&#x4E0D;&#x61C2;Linux&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x4E86;&#xFF0C;10&#x5F20;&#x56FE;&#x7ED9;&#x4F60;&#x5B89;&#x6392;&#x7684;&#x660E;&#x660E;&#x767D;&#x767D;&#xFF01;</a>&#xFF0C;&#x5199;&#x5230;&#x8FD9;&#x91CC;Linux &#x5185;&#x5B58;&#x7BA1;&#x7406;&#x4E13;&#x9898;&#x544A;&#x4E00;&#x6BB5;&#x843D;&#xFF0C;&#x6211;&#x5206;&#x4EAB;&#x7684;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x5F88;&#x57FA;&#x7840;&#xFF0C;&#x57FA;&#x7840;&#x5230;&#x65E5;&#x5E38;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x51E0;&#x4E4E;&#x7528;&#x4E0D;&#x4E0A;&#xFF0C;&#x4F46;&#x6211;&#x8BA4;&#x4E3A;&#x6BCF;&#x4E2A;&#x5728;Linux&#x4E0B;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x90FD;&#x5E94;&#x8BE5;&#x4E86;&#x89E3;&#x3002;</p>
<p>&#x6211;&#x77E5;&#x9053;&#x6709;&#x4E9B;&#x9762;&#x8BD5;&#x5B98;&#x559C;&#x6B22;&#x5728;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x8003;&#x5BDF;&#x4E00;&#x4E0B;&#xFF0C;&#x6216;&#x591A;&#x6216;&#x5C11;&#x53CD;&#x5E94;&#x5019;&#x9009;&#x4EBA;&#x57FA;&#x7840;&#x7D20;&#x517B;&#xFF0C;&#x8FD9;&#x4E24;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x5185;&#x5BB9;&#x4E5F;&#x8DB3;&#x591F;&#x5E94;&#x4ED8;&#x9762;&#x8BD5;&#x3002;&#x8FD8;&#x662F;&#x90A3;&#x53E5;&#x8BDD;&#xFF0C;Linxu &#x5185;&#x5B58;&#x7BA1;&#x7406;&#x592A;&#x590D;&#x6742;&#xFF0C;&#x4E0D;&#x662F;&#x4E00;&#x4E24;&#x7BC7;&#x6587;&#x7AE0;&#x80FD;&#x8BB2;&#x7684;&#x6E05;&#x695A;&#xFF0C;&#x4F46;&#x81F3;&#x5C11;&#x8981;&#x6709;&#x5B8F;&#x89C2;&#x610F;&#x8BC6;&#xFF0C;&#x4E0D;&#x81F3;&#x4E8E;&#x4E00;&#x95EE;&#x4E09;&#x4E0D;&#x77E5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x539F;&#x7406;&#xFF0C;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x4ECE;&#x4E66;&#x4E2D;&#x5E76;&#x7ED3;&#x5408;&#x5185;&#x6838;&#x6E90;&#x7801;&#x5B66;&#x4E60;&#xFF0C;&#x6BCF;&#x5929;&#x8FDB;&#x6B65;&#x4E00;&#x70B9;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x661F;&#x8FB0;&#x5927;&#x6D77;&#x3002;</p>
<p><strong>&#x672C;&#x6587;&#x521B;&#x4F5C;&#x8FC7;&#x7A0B;&#x6211;&#x4E5F;&#x753B;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x793A;&#x4F8B;&#x56FE;&#x89E3;&#xFF0C;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x77E5;&#x8BC6;&#x7D22;&#x5F15;&#xFF0C;&#x4E2A;&#x4EBA;&#x611F;&#x89C9;&#x770B;&#x56FE;&#x8FD8;&#x662F;&#x6BD4;&#x770B;&#x6587;&#x5B57;&#x66F4;&#x6E05;&#x6670;&#x660E;&#x4E86;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x6211;&#x516C;&#x4F17;&#x53F7;&#x300C;&#x540E;&#x7AEF;&#x6280;&#x672F;&#x5B66;&#x5802;&#x300D;&#x540E;&#x53F0;&#x56DE;&#x590D;&#x300C;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x300D;&#x83B7;&#x53D6;&#x8FD9;&#x4E9B;&#x56FE;&#x7247;&#x7684;&#x9AD8;&#x6E05;&#x539F;&#x56FE;&#x3002;</strong></p>
<p>&#x8001;&#x89C4;&#x77E9;&#xFF0C;&#x611F;&#x8C22;&#x5404;&#x4F4D;&#x7684;&#x9605;&#x8BFB;&#xFF0C;&#x6587;&#x7AE0;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5206;&#x4EAB;&#x5BF9;&#x77E5;&#x8BC6;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x6280;&#x672F;&#x7C7B;&#x6587;&#x7AE0;&#x6211;&#x90FD;&#x4F1A;&#x53CD;&#x590D;&#x6C42;&#x8BC1;&#x4EE5;&#x6C42;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x4FDD;&#x8BC1;&#x51C6;&#x786E;&#x6027;&#xFF0C;&#x82E5;&#x6587;&#x4E2D;&#x51FA;&#x73B0;&#x660E;&#x663E;&#x7EB0;&#x6F0F;&#x4E5F;&#x6B22;&#x8FCE;&#x6307;&#x51FA;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x5728;&#x63A2;&#x8BA8;&#x4E2D;&#x5B66;&#x4E60;&#x3002;&#x4ECA;&#x5929;&#x7684;&#x6280;&#x672F;&#x5206;&#x4EAB;&#x5C31;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x671F;&#x518D;&#x89C1;&#x3002;</p>
<p><strong>&#x539F;&#x521B;&#x4E0D;&#x6613;&#xFF0C;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x6211;&#x8FD9;&#x6709;&#x4E00;&#x70B9;&#x70B9;&#x6536;&#x83B7;&#xFF0C;&#x5C31;&#x52A8;&#x52A8;&#x624B;&#x6307;&#x300C;&#x8F6C;&#x53D1;&#x300D;&#x548C;&#x300C;&#x5728;&#x770B;&#x300D;&#x662F;&#x5BF9;&#x6211;&#x6301;&#x7EED;&#x521B;&#x4F5C;&#x7684;&#x6700;&#x5927;&#x652F;&#x6301;&#x3002;</strong></p>
<h2 id="reference">Reference</h2>
<p>&#x300A;Linux&#x5185;&#x6838;&#x8BBE;&#x8BA1;&#x4E0E;&#x5B9E;&#x73B0;(&#x539F;&#x4E66;&#x7B2C;3&#x7248;)&#x300B; </p>
<p>linux&#x5185;&#x6838;slab&#x673A;&#x5236;&#x5206;&#x6790; <a href="https://www.jianshu.com/p/95d68389fbd1" target="_blank">https://www.jianshu.com/p/95d68389fbd1</a> </p>
<p> Linux&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x4E2D;&#x7684;slab&#x5206;&#x914D;&#x5668; <a href="http://edsionte.com/techblog/archives/4019" target="_blank">http://edsionte.com/techblog/archives/4019</a> </p>
<p>Linux slab &#x5206;&#x914D;&#x5668;&#x5256;&#x6790; <a href="https://www.ibm.com/developerworks/cn/linux/l-linux-slab-allocator/index.html#table2" target="_blank">https://www.ibm.com/developerworks/cn/linux/l-linux-slab-allocator/index.html#table2</a> </p>
<p>Linux&#x5185;&#x6838;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x7B97;&#x6CD5;Buddy&#x548C;Slab <a href="https://zhuanlan.zhihu.com/p/36140017" target="_blank">https://zhuanlan.zhihu.com/p/36140017</a> </p>
<p>Linux&#x5185;&#x5B58;&#x4E4B;Slab <a href="https://fivezh.github.io/2017/06/25/Linux-slab-info/" target="_blank">https://fivezh.github.io/2017/06/25/Linux-slab-info/</a> </p>
<p>malloc &#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406; &#x5185;&#x5B58;&#x6C60; mmap sbrk &#x94FE;&#x8868; <a href="https://zhuanlan.zhihu.com/p/57863097" target="_blank">https://zhuanlan.zhihu.com/p/57863097</a> </p>
<p>malloc&#x5B9E;&#x73B0;&#x539F;&#x7406;  <a href="http://luodw.cc/2016/02/17/malloc/" target="_blank">http://luodw.cc/2016/02/17/malloc/</a> </p>
<p>glibc&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x90A3;&#x4E9B;&#x4E8B;&#x513F; <a href="https://www.jianshu.com/p/2fedeacfa797" target="_blank">https://www.jianshu.com/p/2fedeacfa797</a> </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../02/浅谈linux内存管理.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 别再说你不懂Linux内存管理了，10张图给你安排的明明白白">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"面试官：谈谈对物理内存和虚拟内存的理解，一文带你彻底搞懂","level":"1.4","depth":1,"previous":{"title":"别再说你不懂Linux内存管理了，10张图给你安排的明明白白","level":"1.3","depth":1,"path":"linux/linux工具系列/02/浅谈linux内存管理.md","ref":"linux/linux工具系列/02/浅谈linux内存管理.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"linux/linux工具系列/03/linux物理页管理算法.md","mtime":"2020-07-11T15:41:12.218Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-07-11T15:41:58.547Z"},"basePath":"../../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../../gitbook/gitbook.js"></script>
    <script src="../../../gitbook/theme.js"></script>
    
        
        <script src="../../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

