
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Linux下「进程」出问题不要慌，资深程序员教你6招搞定！ · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../02/浅谈linux内存管理.html" />
    
    
    <link rel="prev" href="../../../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../../">
            
                <a href="../../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="linux_tools_cmd.html">
            
                <a href="linux_tools_cmd.html">
            
                    
                    Linux下「进程」出问题不要慌，资深程序员教你6招搞定！
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../02/浅谈linux内存管理.html">
            
                <a href="../02/浅谈linux内存管理.html">
            
                    
                    别再说你不懂Linux内存管理了，10张图给你安排的明明白白
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../03/linux物理页管理算法.html">
            
                <a href="../03/linux物理页管理算法.html">
            
                    
                    面试官：谈谈对物理内存和虚拟内存的理解，一文带你彻底搞懂
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../../.." >Linux下「进程」出问题不要慌，资深程序员教你6招搞定！</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x5DE5;&#x4F5C;5&#x5E74;&#xFF0C;&#x8D44;&#x6DF1;&#x7A0B;&#x5E8F;&#x5458;&#x603B;&#x7ED3;&#xFF1A;&#x5206;&#x6790;Linux&#x8FDB;&#x7A0B;&#x7684;6&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x5168;&#x90FD;&#x544A;&#x8BC9;&#x4F60;</p>
<blockquote>
<p>&#x521B;&#x4F5C;&#x4E0D;&#x6613;&#xFF0C;&#x70B9;&#x8D5E;&#x5173;&#x6CE8;&#x652F;&#x6301;&#x4E00;&#x4E0B;&#x5427;&#xFF0C;&#x6211;&#x7684;&#x66F4;&#x591A;&#x539F;&#x521B;&#x6280;&#x672F;&#x5206;&#x4EAB;&#xFF0C;&#x5173;&#x6CE8;&#x516C;&#x4F17;&#x53F7;&#x300C;<strong>&#x540E;&#x7AEF;&#x6280;&#x672F;&#x5B66;&#x5802;</strong>&#x300D;&#x7B2C;&#x4E00;&#x65F6;&#x95F4;&#x770B;&#xFF01;</p>
</blockquote>
<p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x300C;&#x8FDB;&#x7A0B;&#x300D;&#x662F;&#x5B66;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x8981;&#x63A5;&#x89E6;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xFF0C;&#x629B;&#x5F00;&#x90A3;&#x4E9B;&#x7EAF;&#x7406;&#x8BBA;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5E95;&#x5C42;&#x5B9E;&#x73B0;&#xFF0C;&#x5728;Linux&#x4E0B;&#x505A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FD9;&#x4E48;&#x591A;&#x5E74;&#xFF0C;&#x6BCF;&#x6B21;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x90FD;&#x8981;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x5206;&#x6790;&#x8FDB;&#x7A0B;&#x5404;&#x79CD;&#x72B6;&#x6001;&#xFF0C;&#x53BB;&#x6392;&#x67E5;&#x95EE;&#x9898;&#x51FA;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x8FD9;&#x6B21;lemon&#x5E26;&#x4F60;&#x5728;Linux&#x73AF;&#x5883;&#x4E0B;&#x5B9E;&#x64CD;&#xFF0C;&#x4E00;&#x6B65;&#x6B65;&#x63A2;&#x7A76;&#x63ED;&#x5F00;&#x300C;Linux&#x8FDB;&#x7A0B;&#x300D;&#x7684;&#x90A3;&#x4E9B;&#x79D8;&#x5BC6;&#x3002;</p>
<h2 id="&#x4F55;&#x4E3A;&#x8FDB;&#x7A0B;">&#x4F55;&#x4E3A;&#x8FDB;&#x7A0B;</h2>
<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x8BF4;&#x4E0B;&#x300C;&#x7A0B;&#x5E8F;&#x300D;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x7A0B;&#x5E8F;&#x662F;&#x4E00;&#x4E9B;&#x4FDD;&#x5B58;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x6307;&#x4EE4;&#x7684;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#xFF0C;&#x662F;&#x9759;&#x6001;&#x7684;&#x3002;&#x8FDB;&#x7A0B;&#x662F;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5305;&#x62EC;&#x4E86;&#x52A8;&#x6001;&#x521B;&#x5EFA;&#x3001;&#x8C03;&#x5EA6;&#x548C;&#x6D88;&#x4EA1;&#x7684;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x5B83;&#x662F;&#x7A0B;&#x5E8F;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#x3002; </p>
<p>&#x7EBF;&#x7A0B;&#x662F;&#x64CD;&#x4F5C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x8FDB;&#x884C;&#x8FD0;&#x7B97;&#x8C03;&#x5EA6;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#x3002;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x88AB;&#x5305;&#x542B;&#x5728;&#x8FDB;&#x7A0B;&#x4E4B;&#x4E2D;&#xFF0C;&#x662F;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x5B9E;&#x9645;&#x8FD0;&#x4F5C;&#x5355;&#x4F4D;&#xFF0C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5185;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x662F;&#x8D44;&#x6E90;&#x8C03;&#x5EA6;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#x3002;[&#x5F15;&#x7528;&#x7EF4;&#x57FA;&#x767E;&#x79D1;]</p>
<p><img src="https://imgkr.cn-bj.ufileos.com/73d34b23-bb9d-4193-a496-b00eb036e05e.png" alt="&#x591A;&#x7EBF;&#x7A0B;&#x7A0B;&#x5E8F;&#x6A21;&#x578B;"></p>
<blockquote>
<p>&#x63A2;&#x7A76;&#x8FDB;&#x7A0B;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x4F60;&#x5728;&#x5417;&#xFF1F;&#x8FD8;&#x597D;&#x5417;&#xFF1F;</p>
</blockquote>
<h2 id="ps">ps</h2>
<p><code>report a snapshot of the current processes.</code> &#x5217;&#x51FA;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x8FDB;&#x7A0B;&#x7684;&#x5FEB;&#x7167;&#x3002;</p>
<p>&#x627E;&#x5230;&#x8FDB;&#x7A0B;PID ( Process IDentity )&#xFF0C;pid&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x3002;&#x7528;<code>ps</code>&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#xFF0C;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x90FD;&#x77E5;&#x9053;&#x5427;&#xFF0C;&#x5BF9;&#x4E8E;&#x5C0F;&#x767D;&#x7528;&#x6237;&#xFF0C;&#x9996;&#x5148;&#x4ED6;&#x4E0D;&#x662F;Photoshop&#x3002;</p>
<p><img src="http://ww1.sinaimg.cn/large/9150e4e5ly1frjcour2u8g203c02owej.gif" alt="ps"></p>
<p>&#x7ED9;&#x5927;&#x5BB6;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#xFF0C;&#x4E00;&#x822C;&#x7528;&#x6CD5;&#x662F;<code>ps -ef</code>&#x5217;&#x51FA;&#x7CFB;&#x7EDF;&#x5185;&#x7ECF;&#x5E38;&#x4FE1;&#x606F;&#xFF0C;&#x901A;&#x5E38;&#x90FD;&#x4F1A;&#x5E26;&#x7BA1;&#x9053;<code>grep</code>&#x51FA;&#x81EA;&#x5DF1;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;<code>ps -ef|grep intresting</code>&#x7B2C;&#x4E00;&#x5217;PID&#x4EE3;&#x8868;&#x8FDB;&#x7A0B;&#x53F7;&#xFF0C;PPID&#xFF08;parent process ID&#xFF09;&#x4EE3;&#x8868;&#x7236;&#x8FDB;&#x7A0B;&#x53F7;&#x3002;
<img src="https://upload-images.jianshu.io/upload_images/7842464-be1e324fde371320.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="ps&#x8F93;&#x51FA;&#x5B9E;&#x4F8B;"></p>
<blockquote>
<p>&#x63A2;&#x7A76;&#x8FDB;&#x7A0B;&#x7B2C;&#x4E8C;&#x6B65;&#xFF0C;&#x8BA9;&#x6211;&#x770B;&#x770B;&#x4F60;&#x90FD;&#x4EA4;&#x4E86;&#x54EA;&#x4E9B;&#x670B;&#x53CB;&#xFF08;&#x7CFB;&#x7EDF;&#x8C03;&#x7528; &amp; &#x4FE1;&#x53F7;&#xFF09;</p>
</blockquote>
<h2 id="strace">strace</h2>
<p><code>trace system calls and signals</code>   &#x8DDF;&#x8E2A;&#x8FDB;&#x7A0B;&#x5185;&#x90E8;&#x7684;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x548C;&#x4FE1;&#x53F7; </p>
<blockquote>
<p>&#x4EC0;&#x4E48;&#x662F;&#x300C;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x300D;&#xFF1F;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF08;system call&#xFF09;&#xFF0C;&#x6307;&#x8FD0;&#x884C;&#x5728;&#x300C;&#x7528;&#x6237;&#x6001;&#x300D;&#x7684;&#x7A0B;&#x5E8F;&#x5411;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x300C;&#x5185;&#x6838;&#x6001;&#x300D;&#x8BF7;&#x6C42;&#x9700;&#x8981;&#x66F4;&#x9AD8;&#x6743;&#x9650;&#x8FD0;&#x884C;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x63D0;&#x4F9B;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x4E0E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x63A5;&#x53E3;&#x3002; </p>
</blockquote>
<p><code>strace</code>&#x540E;&#x9762;&#x8DDF;&#x7740;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x53EF;&#x4EE5;&#x8DDF;&#x8E2A;&#x542F;&#x52A8;&#x540E;&#x8FDB;&#x7A0B;&#x7684;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x548C;&#x4FE1;&#x53F7;&#xFF0C;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8FDB;&#x7A0B;&#x6267;&#x884C;&#x65F6;&#x5019;&#x90FD;&#x8C03;&#x7528;&#x4E86;&#x54EA;&#x4E9B;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF0C;&#x901A;&#x8FC7;&#x6307;&#x5B9A;&#x4E0D;&#x540C;&#x7684;&#x9009;&#x9879;&#x53EF;&#x4EE5;&#x8F93;&#x51FA;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x53D1;&#x751F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x7CBE;&#x5EA6;&#x53EF;&#x4EE5;&#x7CBE;&#x786E;&#x5230;&#x5FAE;&#x79D2;&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x53EF;&#x4EE5;&#x7EDF;&#x8BA1;&#x5206;&#x6790;&#x7CFB;&#x7EDF;&#x300C;&#x8C03;&#x7528;&#x7684;&#x8017;&#x65F6;&#x300D;&#xFF0C;&#x8FD9;&#x5728;&#x6392;&#x67E5;&#x8FDB;&#x7A0B;&#x5047;&#x6B7B;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x80FD;&#x5E2E;&#x4F60;&#x53D1;&#x73B0;&#x8FDB;&#x7A0B;&#x5361;&#x5728;&#x54EA;&#x4E2A;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x4E0A;&#x3002;&#x5DF2;&#x7ECF;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x4E5F;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;<code>-p</code>&#x53C2;&#x6570;&#x52A0;<code>pid</code>&#x50CF;<code>gdb attach</code>&#x90A3;&#x6837;&#x9644;&#x7740;&#x4E0A;&#x53BB;&#x8DDF;&#x8E2A;&#x3002;
<img src="https://upload-images.jianshu.io/upload_images/7842464-3c9d2df36326b3bc.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="strace"></p>
<p><img src="https://upload-images.jianshu.io/upload_images/7842464-45579c458ef59d88.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="strace1"></p>
<blockquote>
<p>&#x63A2;&#x7A76;&#x8FDB;&#x7A0B;&#x7B2C;&#x4E09;&#x6B65;&#xFF0C;&#x8BA9;&#x6211;&#x770B;&#x770B;&#x4F60;&#x5E26;&#x7684;&#x5C0F;&#x5F1F;&#x4EEC;&#xFF08;&#x7EBF;&#x7A0B;&#xFF09;&#x3002;</p>
</blockquote>
<h2 id="pstack">pstack</h2>
<p><code>print a stack trace of a running process</code> &#x6253;&#x5370;&#x51FA;&#x8FD0;&#x884C;&#x4E2D;&#x7A0B;&#x5E8F;&#x7684;&#x5806;&#x6808;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x6267;&#x884C;&#x547D;&#x4EE4;<code>pstack pid</code> &#x4F60;&#x80FD;&#x770B;&#x5230;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x5806;&#x6808;&#x4FE1;&#x606F;&#xFF0C;&#x5176;&#x4E2D;&#x7684;pid&#x53EF;&#x7528;&#x4E4B;&#x524D;&#x7684;<code>ps</code>&#x547D;&#x4EE4;&#x83B7;&#x5F97;&#xFF0C;<code>pstack</code>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8FDB;&#x7A0B;&#x5185;&#x542F;&#x52A8;&#x7684;&#x7EBF;&#x7A0B;&#x53F7;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x5185;&#x7EBF;&#x7A0B;&#x7684;&#x300C;&#x5806;&#x6808;&#x300D;&#x5185;&#x5BB9;&#x4E5F;&#x80FD;&#x770B;&#x5230;&#x3002;
<img src="https://upload-images.jianshu.io/upload_images/7842464-4f5108a7bd0631e3.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="pstack"></p>
<p>&#x770B;&#x5230;&#x4E0A;&#x9762;&#x6253;&#x5370;&#x51FA;&#x7684;LWP&#x4E86;&#x5417;&#xFF0C;&#x8FD9;&#x91CC;&#x662F;&#x4E2A;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C; LPW&#x662F;&#x6307;<code>Light-weight process</code> &#x8F7B;&#x91CF;&#x7EA7;&#x7EBF;&#x7A0B;&#x3002;&#x5F15;&#x7533;&#x77E5;&#x8BC6;&#xFF1A;</p>
<blockquote>
<ol>
<li>Linux&#x4E2D;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x7684;&#x7EBF;&#x7A0B;</li>
<li>Linux&#x4E2D;&#x6CA1;&#x6709;&#x7684;&#x7EBF;&#x7A0B;<code>Thread</code>&#x662F;&#x7531;&#x8FDB;&#x7A0B;&#x6765;&#x6A21;&#x62DF;&#x5B9E;&#x73B0;&#x7684;&#x6240;&#x4EE5;&#x79F0;&#x4F5C;&#xFF1A;&#x8F7B;&#x91CF;&#x7EA7;&#x8FDB;&#x7A0B;</li>
<li>&#x8FDB;&#x7A0B;&#x662F;&#x300C;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x300D;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x5143;&#xFF0C;&#x7EBF;&#x7A0B;&#x662F;&#x300C;&#x8D44;&#x6E90;&#x8C03;&#x5EA6;&#x300D;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x5143;&#xFF08;&#x8FD9;&#x91CC;&#x4E0D;&#x8003;&#x8651;&#x534F;&#x7A0B;&#xFF09; </li>
</ol>
<p>&#x63A2;&#x7A76;&#x8FDB;&#x7A0B;&#x7B2C;&#x56DB;&#x6B65;&#xFF0C;&#x8BA9;&#x5C0F;&#x5F1F;&#x4EEC;&#xFF08;&#x7EBF;&#x7A0B;&#xFF09;&#x51FA;&#x6765;&#x6392;&#x4E2A;&#x961F;&#x5427;&#x3002;</p>
</blockquote>
<h2 id="pstree">pstree</h2>
<p><code>display a tree of processes</code> pstree&#x6309;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#x6253;&#x5370;&#x8FD0;&#x884C;&#x4E2D;&#x8FDB;&#x7A0B;&#x7ED3;&#x6784;&#x4FE1;&#x606F;</p>
<p>&#x53EF;&#x4EE5;&#x76F4;&#x89C2;&#x7684;&#x67E5;&#x770B;&#x8FDB;&#x7A0B;&#x548C;&#x5B83;&#x542F;&#x52A8;&#x7684;&#x7EBF;&#x7A0B;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5E76;&#x80FD;&#x663E;&#x793A;&#x8FDB;&#x7A0B;&#x6807;&#x8BC6;&#x3002;</p>
<p><img src="https://upload-images.jianshu.io/upload_images/7842464-779ee63317590602.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="pstree"></p>
<blockquote>
<p>&#x63A2;&#x7A76;&#x8FDB;&#x7A0B;&#x7B2C;&#x4E94;&#x6B65;&#xFF0C;&#x662F;&#x6B7B;&#xFF08;&#x8FDB;&#x7A0B;&#x5D29;&#x6E83;&#xFF09;&#x662F;&#x6D3B;&#xFF08;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#x4E2D;&#xFF09;&#x6211;&#x90FD;&#x8981;&#x77E5;&#x9053;&#x4F60;&#x7684;&#x79D8;&#x5BC6;&#xFF08;&#x5806;&#x6808;&#x5E27; &amp; &#x4E0A;&#x4E0B;&#x6587;&#xFF09;&#x3002;</p>
<h2 id="gdb">gdb</h2>
</blockquote>
<p>gdb&#x662F;GNU&#x5F00;&#x53D1;&#x7684;gcc&#x5957;&#x4EF6;&#x4E2D;Linux&#x4E0B;&#x7A0B;&#x5E8F;&#x8C03;&#x8BD5;&#x5DE5;&#x5177;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x7A0B;&#x5E8F;&#x7684;&#x5806;&#x6808;&#x3001;&#x8BBE;&#x7F6E;&#x65AD;&#x70B9;&#x3001;&#x6253;&#x5370;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x4FE1;&#x606F;&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x80FD;&#x8C03;&#x8BD5;&#x591A;&#x7EBF;&#x7A0B;&#x7A0B;&#x5E8F;&#xFF0C;&#x529F;&#x80FD;&#x5341;&#x5206;&#x5F3A;&#x5927;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x91CC;&#x628A;gdb&#x5F53;&#x6210;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x6765;&#x8BB2;&#x6709;&#x70B9;&#x5927;&#x6750;&#x5C0F;&#x7528;&#xFF0C;&#x8981;&#x8BE6;&#x7EC6;&#x8BF4;gdb&#x7684;&#x8BDD;&#xFF0C;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x6491;&#x8D77;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x7BC7;&#x5E45;&#xFF0C;&#x8FD9;&#x91CC;&#x957F;&#x8BDD;&#x77ED;&#x8BF4;&#xFF0C;&#x6709;&#x673A;&#x4F1A;&#x518D;&#x5F00;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E0B;&#x5B83;&#x3002;</p>
<h3 id="&#x4F7F;&#x7528;">&#x4F7F;&#x7528;</h3>
<p>&#x8981;&#x7528;gdb&#x8C03;&#x8BD5;C/C++&#x7A0B;&#x5E8F;&#x9996;&#x5148;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x5019;&#x8981;&#x52A0;<code>-g</code>&#x9009;&#x9879;&#xFF0C;<code>g++ -g test.cpp -o test</code>&#x8FD9;&#x6837;&#x751F;&#x6210;&#x7684;&#x7A0B;&#x5E8F;&#x5C31;&#x53EF;&#x4EE5;&#x7528;gdb&#x6765;&#x8C03;&#x8BD5;&#x5566;&#x3002;</p>
<ol>
<li>&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x7528;gdb&#x542F;&#x52A8;&#x7A0B;&#x5E8F;&#x8C03;&#x8BD5;&#xFF0C;&#x547D;&#x4EE4;&#xFF1A;<code>gdb prog</code> </li>
<li>&#x7528;gdb&#x9644;&#x7740;&#x5230;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x542F;&#x52A8;&#x7684;&#x8FDB;&#x7A0B;&#x4E0A;&#x8C03;&#x8BD5;&#x4E5F;&#x53EF;&#x4EE5;&#x3002;&#x547D;&#x4EE4;&#xFF1A;<code>gdb prog pid</code></li>
<li>&#x7A0B;&#x5E8F;&#x5D29;&#x6E83;&#x4E4B;&#x540E;&#x53C2;&#x6570;corefile&#x4E5F;&#x53EF;&#x4EE5;&#x7528;gdb&#x8C03;&#x8BD5;&#xFF0C;&#x770B;&#x770B;&#x7A0B;&#x5E8F;&#x6B7B;&#x6389;&#x4E4B;&#x524D;&#x7559;&#x4E86;&#x4EC0;&#x4E48;&#x9057;&#x8A00;&#xFF08;&#x5806;&#x6808;&#x4FE1;&#x606F;&#xFF09;&#x7ED9;&#x4F60;&#x3002;&#x547D;&#x4EE4;&#xFF1A;<code>gdb prog corefile</code>&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x70B9;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x6709;&#x4E9B;Linux&#x7CFB;&#x7EDF;&#x9ED8;&#x8BA4;&#x7A0B;&#x5E8F;&#x5D29;&#x6E83;&#x4E0D;&#x751F;&#x6210;<code>corefile</code>&#xFF0C;&#x8FD9;&#x65F6;&#x4F60;&#x9700;&#x8981;<code>ulimit -c unlimited</code>&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x751F;&#x6210;<code>corefile</code>&#x4E86;&#x3002;
<img src="https://upload-images.jianshu.io/upload_images/7842464-ddc4bfc651297b49.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="gdb&#x8C03;&#x8BD5;"></li>
</ol>
<blockquote>
<p>&#x63A2;&#x7A76;&#x8FDB;&#x7A0B;&#x7B2C;&#x516D;&#x6B65;&#xFF0C;&#x5173;&#x4E8E;&#x4F60;&#x7684;&#x6240;&#x6709;&#xFF0C;&#x6211;&#x90FD;&#x60F3;&#x77E5;&#x9053;&#x3002;</p>
</blockquote>
<h2 id="&#x66F4;&#x8FD1;&#x4E00;&#x6B65;">&#x66F4;&#x8FD1;&#x4E00;&#x6B65;</h2>
<p>&#x901A;&#x8FC7;<code>/proc/pid</code>&#x6587;&#x4EF6;&#x4E86;&#x89E3;&#x8FDB;&#x7A0B;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x4FE1;&#x606F;&#x548C;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#x3002;<code>/proc</code>&#x7CFB;&#x7EDF;&#x662F;&#x4E00;&#x4E2A;&#x4F2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x53EA;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x5F53;&#x4E2D;&#xFF0C;&#x800C;&#x4E0D;&#x5360;&#x7528;&#x5916;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x4EE5;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x65B9;&#x5F0F;&#x4E3A;&#x5185;&#x6838;&#x4E0E;&#x8FDB;&#x7A0B;&#x63D0;&#x4F9B;&#x901A;&#x4FE1;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x8FDB;&#x5165;&#x7CFB;&#x7EDF;<code>/proc</code>&#x76EE;&#x5F55;&#xFF1A;</p>
<p><img src="https://upload-images.jianshu.io/upload_images/7842464-afef80294f10aa0d.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="proc&#x76EE;&#x5F55;"></p>
<p>/proc&#x76EE;&#x5F55;&#x4E0B;&#x6709;&#x5F88;&#x591A;&#x4EE5;&#x6570;&#x5B57;&#x547D;&#x540D;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x6BCF;&#x4E2A;&#x6570;&#x5B57;&#x4EE3;&#x8868;&#x8FDB;&#x7A0B;&#x53F7;PID&#x5B83;&#x4EEC;&#x662F;&#x8FDB;&#x7A0B;&#x76EE;&#x5F55;&#x3002;&#x7CFB;&#x7EDF;&#x4E2D;&#x5F53;&#x524D;&#x8FD0;&#x884C;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;/proc&#x4E0B;&#x90FD;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x4EE5;&#x8FDB;&#x7A0B;&#x53F7;&#x4E3A;&#x76EE;&#x5F55;&#x540D;&#x7684;&#x76EE;&#x5F55;<code>/proc/pid</code>&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x8BFB;&#x53D6;&#x8FDB;&#x7A0B;&#x4FE1;&#x606F;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FDB;&#x5230;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x91CC;&#x9762;&#xFF0C;&#x4E86;&#x89E3;&#x8FDB;&#x7A0B;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x4FE1;&#x606F;&#x548C;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#x3002;</p>
<h3 id="&#x9AD8;&#x9891;&#x4F7F;&#x7528;">&#x9AD8;&#x9891;&#x4F7F;&#x7528;</h3>
<p><code>/proc/pid</code>&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x6709;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x6587;&#x4EF6;&#xFF0C;&#x6311;&#x51E0;&#x4E2A;&#x4F7F;&#x7528;&#x9891;&#x7387;&#x9AD8;&#x7684;&#x8BB2;&#x4E00;&#x8BB2;&#x3002;
<code>/proc/pid/environ</code> &#x5305;&#x542B;&#x4E86;&#x8FDB;&#x7A0B;&#x7684;&#x53EF;&#x7528;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x7684;&#x5217;&#x8868; &#x3002;&#x7A0B;&#x5E8F;&#x51FA;&#x95EE;&#x9898;&#x4E86;&#x5982;&#x679C;&#x4E0D;&#x786E;&#x5B9A;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x662F;&#x5426;&#x8BBE;&#x7F6E;&#x751F;&#x6548;&#xFF0C;&#x53EF;&#x4EE5;<code>cat</code>&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x51FA;&#x6765;&#x67E5;&#x770B;&#x786E;&#x8BA4;&#x4E00;&#x4E0B;&#x3002;</p>
<p><code>/proc/pid/fd/</code> &#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x5305;&#x542B;&#x4E86;&#x8FDB;&#x7A0B;&#x6253;&#x5F00;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x94FE;&#x63A5;&#x3002;&#x4ECE;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x8FDB;&#x7A0B;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x3001;&#x8F93;&#x51FA;&#x3001;&#x9519;&#x8BEF;&#x6D41;&#xFF0C;&#x8FDB;&#x7A0B;&#x6253;&#x5F00;&#x7684;<code>socket</code>&#x8FDE;&#x63A5;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x4E5F;&#x80FD;&#x770B;&#x5230;&#xFF0C;<code>lsof</code>&#x547D;&#x4EE4;&#x4E5F;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x4F5C;&#x7528;&#x3002;</p>
<p><code>/proc/pid/stat</code>&#x5305;&#x542B;&#x4E86;&#x8FDB;&#x7A0B;&#x7684;&#x6240;&#x6709;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#xFF0C;&#x8FDB;&#x7A0B;&#x53F7;&#x3001;&#x7236;&#x8FDB;&#x7A0B;&#x53F7;&#x3001; &#x7EBF;&#x7A0B;&#x7EC4;&#x53F7;&#x3001; &#x8BE5;&#x4EFB;&#x52A1;&#x5728;&#x7528;&#x6237;&#x6001;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x95F4; &#x3001; &#x8BE5;&#x4EFB;&#x52A1;&#x5728;&#x7528;&#x5185;&#x6838;&#x6001;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x95F4;&#x3001; &#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x7684;&#x4EE3;&#x7801;&#x6BB5;&#x3001; &#x963B;&#x585E;&#x4FE1;&#x53F7;&#x7684;&#x4F4D;&#x56FE;&#x7B49;&#x7B49;&#x4FE1;&#x606F;&#x5E94;&#x6709;&#x5C3D;&#x6709;&#x3002;</p>
<h3 id="&#x5176;&#x4ED6;&#x7EDF;&#x8BA1;">&#x5176;&#x4ED6;&#x7EDF;&#x8BA1;</h3>
<p><code>/proc/pid/cmdline</code> &#x5305;&#x542B;&#x4E86;&#x7528;&#x4E8E;&#x5F00;&#x59CB;&#x8FDB;&#x7A0B;&#x7684;&#x547D;&#x4EE4;<br><code>/proc/pid/cwd</code>&#x5305;&#x542B;&#x4E86;&#x5F53;&#x524D;&#x8FDB;&#x7A0B;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x7684;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;<br><code>/proc/pid/exe</code>&#x5305;&#x542B;&#x4E86;&#x6B63;&#x5728;&#x8FDB;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x94FE;&#x63A5;<br><code>/proc/pid/mem</code>&#x5305;&#x542B;&#x4E86;&#x8FDB;&#x7A0B;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5185;&#x5BB9;<br><code>/proc/pid/statm</code>&#x5305;&#x542B;&#x4E86;&#x8FDB;&#x7A0B;&#x7684;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x4FE1;&#x606F;</p>
<h2 id="&#x603B;&#x7ED3;&#x4E00;&#x4E0B;">&#x603B;&#x7ED3;&#x4E00;&#x4E0B;</h2>
<p>&#x597D;&#x4E86;&#xFF0C;&#x4E00;&#x987F;&#x64CD;&#x4F5C;&#x4E0B;&#x6765;&#xFF0C;&#x4F60;&#x5BF9;&#x8FDB;&#x7A0B;&#x548C;&#x5B83;&#x80CC;&#x540E;&#x7684;&#x79D8;&#x5BC6;&#x4F60;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x4E86;&#x89E3;&#x4E86;&#xFF0C;&#x4E0B;&#x6B21;&#x6211;&#x4EEC;&#x7684;&#x597D;&#x670B;&#x53CB;&#x300C;&#x8FDB;&#x7A0B;&#x300D;&#x5982;&#x679C;&#x9047;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF08;&#x5D29;&#x6E83;<code>coredump</code>&#x3001;&#x5047;&#x6B7B;&#x3001;&#x963B;&#x585E;&#x3001;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x8D85;&#x65F6;&#x3001;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x5F02;&#x5E38;&#xFF09;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x5E2E;&#x5B83;&#x5904;&#x7406;&#x4E86;&#x5427;&#xFF01;&#x6211;&#x4EEC;&#x6765;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF1A;</p>
<ul>
<li>ps&#x67E5;&#x770B;&#x8FDB;&#x7A0B;id&#xFF0C;&#x770B;&#x770B;&#x8FDB;&#x7A0B;&#x8FD8;&#x5728;&#x4E0D;&#x5728;&#x4EE5;&#x53CA;&#x8FDB;&#x7A0B;&#x72B6;&#x6001;</li>
<li>&#x5982;&#x679C;&#x5728;&#x7684;&#x8BDD;<code>strace</code>&#x3001;<code>psstack</code>&#x770B;&#x4E0B;&#x8FDB;&#x7A0B;&#x5F53;&#x524D;&#x4FE1;&#x606F;&#xFF0C;&#x662F;&#x4E0D;&#x5361;&#x6B7B;&#x5728;&#x54EA;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x5BF9;&#x6BD4;&#x5404;&#x5E27;&#x6700;&#x540E;&#x8C03;&#x7528;&#x4FE1;&#x606F;&#x627E;&#x5230;&#x5F02;&#x5E38;&#x70B9;</li>
<li>&#x5982;&#x679C;&#x8FDB;&#x7A0B;&#x4E0D;&#x518D;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x6709;<code>corefile</code>&#x6587;&#x4EF6;&#xFF0C;&#x76F4;&#x63A5;&#x4E0A;<code>gdb</code>&#x67E5;&#x770B;<code>corefile</code>&#x4FE1;&#x606F;</li>
<li>&#x5176;&#x4ED6;&#x7591;&#x96BE;&#x6742;&#x75C7;&#x6000;&#x7591;&#x8FDB;&#x7A0B;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x770B;&#x770B;<code>/proc/pid</code>&#x4E0B;&#x9762;&#x7684;&#x8FDB;&#x7A0B;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x7ED9;&#x4F60;&#x542F;&#x53D1;&#x3002;</li>
<li>&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x4EE5;&#x4E0A;&#x90FD;&#x4E0D;&#x884C;&#xFF0C;&#x95ED;&#x76EE;&#x7948;&#x7977;&#x5427;&#xFF01;</li>
</ul>
<p><img src="http://wx1.sinaimg.cn/large/cf652d2bgy1fgchzezbpdj20k00k0dhe.jpg" alt=""></p>
<h2 id="&#x5199;&#x5728;&#x6700;&#x540E;">&#x5199;&#x5728;&#x6700;&#x540E;</h2>
<p>&#x4ECA;&#x5929;&#x7684;&#x5206;&#x4EAB;&#x5E0C;&#x671B;&#x5BF9;&#x4F60;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x795D;&#x5927;&#x5BB6;&#x5199;&#x7684;&#x670D;&#x52A1;&#x6C38;&#x4E0D;&#x5B95;&#x673A;&#xFF0C;&#x4ECE;&#x4E0D;coredump&#xFF0C;&#x8BA9;&#x4E0A;&#x9762;&#x6559;&#x4F60;&#x7684;&#x64CD;&#x4F5C;&#x5403;&#x7070;&#x53BB;&#x5427;&#x3002;
<img src="https://upload-images.jianshu.io/upload_images/7842464-f7a94cc986f4ebb9.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x6C38;&#x4E0D;&#x5B95;&#x673A;"></p>
<div align="center"> &#x56FE;&#x7247;&#x6765;&#x6E90;&#x7F51;&#x7EDC;|&#x4FB5;&#x5220; </div>


<p>&#x6700;&#x540E;&#xFF0C;&#x611F;&#x8C22;&#x5404;&#x4F4D;&#x7684;&#x9605;&#x8BFB;&#x3002;&#x6587;&#x7AE0;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5206;&#x4EAB;&#x5BF9;&#x77E5;&#x8BC6;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x6280;&#x672F;&#x7C7B;&#x6587;&#x7AE0;&#x6211;&#x90FD;&#x4F1A;&#x53CD;&#x590D;&#x6C42;&#x8BC1;&#x4EE5;&#x6C42;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x4FDD;&#x8BC1;&#x51C6;&#x786E;&#x6027;&#xFF0C;&#x82E5;&#x6587;&#x4E2D;&#x51FA;&#x73B0;&#x660E;&#x663E;&#x7EB0;&#x6F0F;&#x4E5F;&#x6B22;&#x8FCE;&#x6307;&#x51FA;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x5728;&#x63A2;&#x8BA8;&#x4E2D;&#x5B66;&#x4E60;&#x3002;</p>
<h2 id="reference">reference</h2>
<p> <a href="https://man.linuxde.net/gdb" target="_blank">https://man.linuxde.net/gdb</a> </p>
<p> <a href="https://blog.csdn.net/dan15188387481/article/details/49450491" target="_blank">https://blog.csdn.net/dan15188387481/article/details/49450491</a> </p>
<p> <a href="https://blog.csdn.net/m0_37925202/article/details/78759408" target="_blank">https://blog.csdn.net/m0_37925202/article/details/78759408</a> </p>
<p><a href="https://blog.csdn.net/enweitech/article/details/53391567" target="_blank">https://blog.csdn.net/enweitech/article/details/53391567</a></p>
<h3 id="&#x521B;&#x4F5C;&#x4E0D;&#x6613;&#xFF0C;&#x70B9;&#x8D5E;&#x5173;&#x6CE8;&#x652F;&#x6301;&#x4E00;&#x4E0B;&#x5427;">&#x521B;&#x4F5C;&#x4E0D;&#x6613;&#xFF0C;&#x70B9;&#x8D5E;&#x5173;&#x6CE8;&#x652F;&#x6301;&#x4E00;&#x4E0B;&#x5427;</h3>
<p>&#x6211;&#x4F1A;&#x6301;&#x7EED;&#x5206;&#x4EAB;&#x8F6F;&#x4EF6;&#x7F16;&#x7A0B;&#x548C;&#x7A0B;&#x5E8F;&#x5458;&#x90A3;&#x4E9B;&#x4E8B;&#xFF0C;&#x6B22;&#x8FCE;&#x5173;&#x6CE8;&#x3002;&#x82E5;&#x4F60;&#x5BF9;&#x7F16;&#x7A0B;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x6211;&#x6574;&#x7406;&#x4E86;&#x8FD9;&#x4E9B;&#x5E74;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x5927;&#x7EA6;3G&#x7684;&#x8D44;&#x6E90;&#x6C47;&#x603B;&#xFF0C;&#x5173;&#x6CE8;&#x516C;&#x4F17;&#x53F7;&#x300C;<strong>&#x540E;&#x7AEF;&#x6280;&#x672F;&#x5B66;&#x5802;</strong>&#x300D;&#x540E;&#x53D1;&#x9001;&#x300C;<strong>&#x8D44;&#x6599;</strong>&#x300D;&#x514D;&#x8D39;&#x83B7;&#x53D6;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../../../" class="navigation navigation-prev " aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../02/浅谈linux内存管理.html" class="navigation navigation-next " aria-label="Next page: 别再说你不懂Linux内存管理了，10张图给你安排的明明白白">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Linux下「进程」出问题不要慌，资深程序员教你6招搞定！","level":"1.2","depth":1,"next":{"title":"别再说你不懂Linux内存管理了，10张图给你安排的明明白白","level":"1.3","depth":1,"path":"linux/linux工具系列/02/浅谈linux内存管理.md","ref":"linux/linux工具系列/02/浅谈linux内存管理.md","articles":[]},"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"linux/linux工具系列/01/linux_tools_cmd.md","mtime":"2020-07-11T08:26:35.828Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-07-11T08:31:21.192Z"},"basePath":"../../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../../gitbook/gitbook.js"></script>
    <script src="../../../gitbook/theme.js"></script>
    
        
        <script src="../../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

